Revit 2027 API
SizingOptions.Area Property
 The area of the specified sizing profile and dimension.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
public:
property double Area {
	double get ();
}
member Area : float with get
Property Value
Double
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace